function draw(ang){
  var canvas = document.getElementById('can');  //отримуємо контекст canvas
  var ctx = canvas.getContext('2d');

  ctx.clearRect(0,0,500,500); //очищуємо область
  ctx.translate(250,250); //зміщуємо центр координат
  ctx.fillStyle = "black";  //задаємо колір заливки
  ctx.strokeStyle = "#333333"; //задаємо колір контуру
  ctx.lineWidth = 3; //задаємо ширину лінії


  var matrix = [        //ініціалізація матриці
  [-70, 87],
  [0, 200],
  [50, 87]
  ];

  var t = [[0,0,0], //ініціалізація матриці 3*3
  [0,0,0],
  [0,0,0]];

  var r = [[0,0,0], //ініціалізація матриці 3*3
  [0,0,0],
  [0,0,0]];

  var b = [[0,0,0], //ініціалізація матриці 3*3
  [0,0,0],
  [0,0,0]];

  var x = [[0, 0],  //ініціалізація матриці координат фігури
  [0, 0],
  [0, 0]]

  function i_r(){   //присвоєння матриці r значення одиничної
    for(i=0;i<3;i++){ //індекс стрічок
      for(j=0;j<3;j++){ //індекс стовбців
        r[i][j]=0;    //присвоєння значення 0
      }
      r[i][i]=1;  //присчоєння значення 1 елементам головної діагоналі
    }
  }


  function mult() { // множення матриць t та r
    for(i=0;i<3;i++){ //індекс стрічок
      for(j=0;j<3;j++){ //індекс стовбців
        z=0;
        for(k=0;k<3;k++){
          z+=t[i][k]*r[k][j];
        }
        b[i][j]=z;
      }
    }
    for(i=0;i<3;i++){
      for(j=0;j<3;j++){
        r[i][j]=b[i][j];
      }
    }
  }


  function rotat(angle){    //поворот на кут
    //переведення градусів в радіани
    rad = angle/180*Math.PI;

    for (i=0; i < 3; i++) {   //індекс стрічок
        for (j=0; j < 3; j++) { //індекс стовбців
        t[i][j]=0;  //присвоєння значення 0
      }
    }

    t[2][2]=1;  //присвоєння значення 1 нижньому правому елементу матриці

    t[0][0]=Math.cos(rad);  //присвоєння елементу значення косинуса кута повороту
    t[1][1]=Math.cos(rad);  //присвоєння елементу значення косинуса кута повороту

    t[0][1]=-Math.sin(rad); //присвоєння елементу від'ємного значення синуса кута повороту
    t[1][0]=Math.sin(rad);  //присвоєння елементу значення синуса кута повороту
    mult();   //множення матриць
  }



  function tran(dx,dy){   //переніс об"єкта на х і у
    for(i=0;i<3;i++){ //індекс стрічок
      for(j=0;j<3;j++){ //індекс стовбців
        t[i][j]=0;  //присвоєння значення 0
      }
      t[i][i]=1;  //присвоєння значення 1
    }
    t[0][2]=dx; //значення зміщєння по осі х
    t[1][2]=dy; //значення зміщєння по осі у
    mult(); //множення матриць
  }


  function new_xy(){      //нові координати фігури
    for (i=0;i<3;i++){
      //розрахунок нової координати по осі х
      x[i][0]= Math.round(matrix[i][0]*r[0][0] + matrix[i][1]*r[0][1] + r[0][2]);
      //розрахунок нової координати по осі у
      x[i][1]= Math.round(matrix[i][0]*r[1][0] + matrix[i][1]*r[1][1] + r[1][2]);
    }
  }


  function rot_xy(xc,yc,beta){  //поворот фігури відносно заданої точки
    tran(-xc,-yc);  //зміщєння до початку координат
    rotat(beta);  //поворот не заданий кут
    tran(xc,yc);  //зміщєння до заданої точки
  }


  function pict() { //малювання фігури
    ctx.save(); //збереження стану
    ctx.beginPath();  //початок задання контуру фігури
    ctx.moveTo(x[0][0],x[0][1]);  //задання початкової точки
    for (var i=1; i < 3; i++) { //перебір точок фігури
      ctx.lineTo(x[i][0],x[i][1]);  //проведення ліній по заданим точкам
  };

  ctx.closePath();  //замикання фігури
  ctx.stroke(); //відображення контуру
  ctx.fill();   //заливка фігури
  ctx.restore();  //знищення стану
  }

  function angle(gra){
    i_r();  //присвоєння матриці r значення одиничної
    rot_xy(50,87,gra);  //поворот фігури відносно заданої точки на заданий кут
    new_xy(); //нові координати фігури
    pict(); //малювання фігури
  }



  for (kil=0;kil<6;kil++){  //відображення шести стулок діафрагми
    angle(ang); //відображення стулки діафрагми
    //поворот координатної площини
    ctx.rotate(Math.PI/3);
  }
  ctx.save(); //збереження стану
  ctx.lineWidth = 120;  //ширина контуру кільця
  ctx.strokeStyle = "rgba(115, 116, 133, 0.8)"; //задання кольору та прозорості кільця
  ctx.beginPath();  //початок задання фігури
  ctx.arc(0,0,150,0,Math.PI*2,true);  //задання кола
  ctx.stroke(); //відображення контуру
  ctx.restore();  //знищення стану
  ctx.translate(-250,-250); //зміщуємо центр координат
}

function draw_hand(){  //отримання значення кута повороту ручного режиму
  kut=document.getElementById("ang").value;
  draw(kut);
}

function avto() { // функція автоматичного повороту
  kut=0;  //початкове значення кута повороту
  var timerId = setInterval(function() {  //інтервал виклику функції
  draw(kut);  //функція відображення елементу з заданим кутом повороту

  if (kut >= 60) {clearInterval(timerId); //зупинка викликів функції
    var timerId2 = setInterval(function() { //інтервал виклику функції
  draw(kut); //функція відображення елементу з заданим кутом повороту

  if (kut <= 0) clearInterval(timerId2);  //зупинка викликів функції
  kut-=3; //зменшення значення кута повороту
  }, 1);  //час виклику функції у мс
  };
  kut+=3; //збільшення значення кута повороту
  }, 1);  //час виклику функції у мс

}
